Я автотестировщик ПО / QA automation engineer.

Профессиональные навыки:

- Автоматизированное тестирование веб приложений
- Написание браузерных тестов на Java с использованием Selenium и JUnit
- Поиск элементов DOM-модели с помощью CSS и XPath
- Знание основ Java
- Ручное тестирование веб приложений
- Применение техник тест-дизайна на практике
- Составление баг-репортов
- Работа с API (Postman)
- Приемочное и регрессионное тестирование
- Тестирование мобильных приложений
- Работа в Android Studio
- Знание основ веб-верстки;
- Работа с базами данных MySQL
- Работа с системой контроля версий Git
- Работа в баг-рекере Jira
- Мои основные инструменты: Jira, Postman, Chrome DevTools, Android Studio, IntelliJ IDEA, MySQL, GitLab.

Мои работы:

Автотесты регрессионных сценариев для Интернет-магазина: https://github.com/IrinaIlina/Autotests-java
Ручное тестирование web-приложений (тестирование сайта интернет-магазина): https://clck.ru/33GJJy
Тестирование мобильного приложения "Прокат велосипедов": https://clck.ru/33GJKK

Обо мне: Мне нравится разрабатывать способы оптимизации рабочего процесса и внедрять новые подходы к реализации поставленных задач. Я всегда нацелена на результат и люблю порядок в работе. Мне интересно развиваться и решать сложные задачи. Я открыта к изучению нового и готова перенимать опыт коллег и делиться своим. Мне важно довести начатое дело до конца.
